
module.exports = {
  menu: {
    title: '铁科经纬（西安）信息科技有限公司',
    home1: "首页",
    home2: "产品",
    home3: "规范",
    home4: "培训",
    home5: "联系我们",
    home6: '语言'
  },

  page_index: {
    line_two: {
      span1: "成为铁路行业数字化转型的先锋军",
      span2: "云原生技术专家"
    },
    line_three: {
      h1: '服务为本',
      p1: '为应用软件研发运行服务，采用自服务方式，提供持续的技术赋能和支撑保障服务，平台团队与铁路软件研发团队共同成长。',
      h2: '能力为基',
      p2: '基于PaaS的铁路软件研发，结合铁路应用系统多样性和技术成熟度，建设和运营PaaS，促进能力建设和体系发展。',
      h3: '应用转化',
      p3: '从成功应用的典型铁路应用软件研发中沉淀，逐步规范、推广到其他铁路应用软件研发中，持续优化完善。',
      h4: '注重集成',
      p4: 'PaaS服务模式为一站式自服务，降低门槛，与软件开发运维能力无缝集成，在源头将PaaS中公共服务能力广泛集成和应用。',
      h5: '了解铁路PaaS平台',
      p5: '集铁科院的研发实践、前沿研发理念、先进研发工具为一体的开发测试PaaS云平台面向开发者提供研发工具产品和服务，让软件开发质量有保障，更简单高效'
    },
    line_fore: {
      but: '了解详情'
    },
    line_five: {
      p1: '行业应用场景',
      h2: 'API应用',
      p2: '应用开发人员通过PaaS对API和微服务，进行开发、运行、管理和安全保障。',
      h3: '物联网应用',
      p3: 'PaaS支撑各类物联网应用运行环境、开发语言、部署和管理工具。',
      h4: '数据分析应用',
      p4: 'PaaS为数据分析提供工具和运行环境。',
      h5: '移动互联网应用',
      p5: 'PaaS提供移动应用前、后端开发框架、运行环境和APP分发管理工具等。'
    },
    line_six: {
      p1: '项目案例',
      sp1: '川藏铁路技术创新协作平台',
      sp2: '财务信息系统自助服务平台',
      sp3: '国铁采购平台二期',
      sp4: '网络安全和信息化管理信息系统'
    }
  },

  page_product: {
    line_two: {
      h: '了解铁路PaaS平台',
      p: '铁路开发测试平台是基于Kubernetes技术，与微服务、容器无缝融合，兼容不同基础设施的开发运维一体化企业级PaaS平台为企业IT的开发、测试、部署、运维、管理等能力提供数化转型核心支撑，实现基于PaaS的铁路软件研发与交付。'
    },
    line_three: {
      sp: '解决的痛点',
      p1: '实现研发全过程的闭环管理',
      p2: '通过配置管理平台提供的统一接口，获取代码仓库、持续集成引擎、持续部署引擎、源代码静态检查工具的实时数据，实现了项目计划与研发进度之间的自动化关联，形成闭环管理。',
      p3: '构建完整的持续集成测试和部署工具链',
      p4: '以应用为中心的应用发布和全生命周期管理，提供容器/非容器应用发布和管理、资源申请、应用架构守护、灰度发布、流程管控等能力，让软件更简单，快捷，安全，高效的交付。',
      p5: '丰富了中间件工具提升软件研发效率',
      p6: '云计算场景下基于开源方案提供了API网关、认证授权、LDAP、对象存储、全文检索、流程引擎等中间件服务，构建“平台+应用”的模式以及平台服务于应用的能力，降低应用开发的工作量和难度，提升软件研发效率。'
    },
    line_four: {
      sp: '我们的优势',
      p1: '为铁路软件开发特点量身打造，降低门槛',
      p2: '与铁路业务共同持续发展，降低成本'
    },
    line_five: {
      sp: '产品矩阵',
      sp1: '项目协作平台',
      p1: '提供工作项协同、迭代跟踪、工作流、统计报表等功能，帮助研发团队更快更好地交付产品。使用团队协作与项目管理工具，高效协同生产，提高交付效率。',
      sp2: '容器编排平台',
      p2: '一站式的完备的分布式系统支撑平台， 支持多层安全防护、准入机制、多租户应用支撑， 助企业降低 IT 成本，提升运维效率',
      sp3: '开发者平台',
      p3: '面向开发者打造的一站式开发平台，实现企业内技术共享、框架复用，做到开发的规范，快速上手、高效交付，助力企业快速开发交付分布式应用系统',
      sp4: '持续交付平台',
      p4: '企业级持续集成和持续交付工具，支持应用架构守护、灰度发布、流程管控等能力，让您的软件简单，快捷，安全，高效的交付'
    }
  }

}