
module.exports = {
  menu: {
    title: '铁科经纬（西安）信息科技有限公司',
    home1: "首页",
    home2: "产品",
    home3: "规范",
    home4: "培训",
    home5: "联系我们",
    home6: '语言'
  },

  page_index: {
    line_two: {
      span1: "成为铁路行业数字化转型的先锋军",
      span2: "云原生技术专家"
    },
    line_three: {
      h1: '服务为本',
      p1: '为应用软件研发运行服务，采用自服务方式，提供持续的技术赋能和支撑保障服务，平台团队与铁路软件研发团队共同成长。',
      h2: '能力为基',
      p2: '基于PaaS的铁路软件研发，结合铁路应用系统多样性和技术成熟度，建设和运营PaaS，促进能力建设和体系发展。',
      h3: '应用转化',
      p3: '从成功应用的典型铁路应用软件研发中沉淀，逐步规范、推广到其他铁路应用软件研发中，持续优化完善。',
      h4: '注重集成',
      p4: 'PaaS服务模式为一站式自服务，降低门槛，与软件开发运维能力无缝集成，在源头将PaaS中公共服务能力广泛集成和应用。',
      h5: '了解铁路PaaS平台',
      p5: '集铁科院的研发实践、前沿研发理念、先进研发工具为一体的开发测试PaaS云平台面向开发者提供研发工具产品和服务，让软件开发质量有保障，更简单高效'
    },
    line_fore: {
      but: '了解详情'
    },
    line_five: {
      p1: '行业应用场景',
      h2: 'API应用',
      p2: '应用开发人员通过PaaS对API和微服务，进行开发、运行、管理和安全保障。',
      h3: '物联网应用',
      p3: 'PaaS支撑各类物联网应用运行环境、开发语言、部署和管理工具。',
      h4: '数据分析应用',
      p4: 'PaaS为数据分析提供工具和运行环境。',
      h5: '移动互联网应用',
      p5: 'PaaS提供移动应用前、后端开发框架、运行环境和APP分发管理工具等。'
    },
    line_six: {
      p1: '项目案例',
      sp1: '川藏铁路技术创新协作平台',
      sp2: '财务信息系统自助服务平台',
      sp3: '国铁采购平台二期',
      sp4: '网络安全和信息化管理信息系统'
    }
  },

  page_product: {
    line_two: {
      h: '了解铁路PaaS平台',
      p: '铁路开发测试平台是基于Kubernetes技术，与微服务、容器无缝融合，兼容不同基础设施的开发运维一体化企业级PaaS平台为企业IT的开发、测试、部署、运维、管理等能力提供数化转型核心支撑，实现基于PaaS的铁路软件研发与交付。'
    },
    line_three: {
      sp: '解决的痛点',
      p1: '实现研发全过程的闭环管理',
      p2: '通过配置管理平台提供的统一接口，获取代码仓库、持续集成引擎、持续部署引擎、源代码静态检查工具的实时数据，实现了项目计划与研发进度之间的自动化关联，形成闭环管理。',
      p3: '构建完整的持续集成测试和部署工具链',
      p4: '以应用为中心的应用发布和全生命周期管理，提供容器/非容器应用发布和管理、资源申请、应用架构守护、灰度发布、流程管控等能力，让软件更简单，快捷，安全，高效的交付。',
      p5: '丰富了中间件工具提升软件研发效率',
      p6: '云计算场景下基于开源方案提供了API网关、认证授权、LDAP、对象存储、全文检索、流程引擎等中间件服务，构建“平台+应用”的模式以及平台服务于应用的能力，降低应用开发的工作量和难度，提升软件研发效率。'
    },
    line_four: {
      sp: '我们的优势',
      p1: '为铁路软件开发特点量身打造，降低门槛',
      p2: '与铁路业务共同持续发展，降低成本'
    },
    line_five: {
      sp: '产品矩阵',
      sp1: '项目协作平台',
      p1: '提供工作项协同、迭代跟踪、工作流、统计报表等功能，帮助研发团队更快更好地交付产品。使用团队协作与项目管理工具，高效协同生产，提高交付效率。',
      sp2: '容器编排平台',
      p2: '一站式的完备的分布式系统支撑平台， 支持多层安全防护、准入机制、多租户应用支撑， 助企业降低 IT 成本，提升运维效率',
      sp3: '开发者平台',
      p3: '面向开发者打造的一站式开发平台，实现企业内技术共享、框架复用，做到开发的规范，快速上手、高效交付，助力企业快速开发交付分布式应用系统',
      sp4: '持续交付平台',
      p4: '企业级持续集成和持续交付工具，支持应用架构守护、灰度发布、流程管控等能力，让您的软件简单，快捷，安全，高效的交付'
    },
  },

  page_standard: {
    line_two: {
      h: '规范的意义',
      p: '缺少研发技术和过程规范将导致软件研发的4大问题',
      sp1: '成本高',
      sp2: '质量低',
      sp3: '交付慢',
      sp4: '共享难',
      p1: '软件系统是由多个彼此关联的部分组成，需要适应业务的变化而快速变化，需要分工协作复杂的研发过程构建。简单明确、可执行性强的规范，明确技术选型、工作标准和操作流程，打造标准化的研发工作模式，让团队可快速高效的执行，是软件系统研发质量和效率的有力保障。'
    },
    line_three: {
      h: '铁路规范体系'
    },
    line_four: {
      h: '开发规范',
      sp1: '软件开发规范',
      sp2: '开发过程与技术管理规范'
    },
    soft_dev_spec: [
      'API命名规范', '模块命名规范', '通讯协议规范', '响应式布局规范',
      '无状态服务规范', '认证登录规范', '服务标签规范', 'redis使用规范',
      '监控数据传送规范', '自动化测试规范', 'UI测试规范', 'Mysql备份规范',
      '代码仓管理规范', '蓝绿部署规范', '监控报警规范', '更多...'
    ],
    dev_and_tech: [
      '前端开发规范', '后端开发规范', '测试', '上线部署规范', '多团队协作规范', '更多...'
    ]
  },

  page_train: {
    line_two: {
      h: '培训模型',
      p: '培训课程通过理论+案例+实操的三位一体的方式，深入浅出的培养基于Kubernetes的全栈式应用研发工程师。课程内容紧跟时代发展，不断迭代更新，涵盖应用时下热门技术框架，注重案例和实操，融入大量全真项目实训，从需求分析到项目研发再到项目测试，学员可参与每个流程细节，帮助学员学会、学懂、学透。'
    },
    line_three: {
      h: '培训体系',
      sp: '案例演示',

      h1: 'Day 1',
      p1: '课程题目：',
      p2: '云原生简介；入门云原生应用开发（上）；实际案例讲解',
      p3: '课程简介：',
      p4: '什么是云原生，云原生开源：微服务、容器化、CI/CD；基础环境搭建（Docker、VMware、Git）；用一个案例跑通环境',

      h2: 'Day 2',
      p5: '课程题目：',
      p6: '入门云原生应用开发（中）；Docker、Docker Compose介绍',
      p7: '课程简介：',
      p8: 'git的安装、命令和使用，代码编写、代码结构等；Docker、Docker Compose介绍',

      h3: 'Day 3',
      p9: '课程题目：',
      p10: '入门云原生应用开发（下）',
      p11: '课程简介：',
      p12: '镜像打包、Dockerfile编写；流水线部署安装和ArgoCD部署、流水线全过程演示',

      sp1: '专项实操',

      til1: '容器平台实操',
      h4: 'Day 4',
      p13: '课程题目：Kubernetes实操环境安装和指令实操',
      p14: '课程简介：Kubernetes本地安装、日常处理指令讲解，备份，操作演示和实操指导',
      h5: 'Day 5',
      p15: '课程题目：Kubernetes应用',
      p16: '课程简介：Kubernetes Operator介绍，Operator 部署，API调用，演示+同步实操指导',

      til2: '前端开发实操',
      h6: 'Day 6',
      p17: '课程题目：基于VUE的前端开发',
      p18: '课程简介：前端框架VUE介绍、配置，代码逻辑实现和运行展示演示',
      h7: 'Day 7',
      p19: '课程题目：基于Element UI组件库的前端开发',
      p20: '课程简介：Element UI组件库介绍、引用组件库组件开发，微前端案例展示',

      til3: '后端微服务实操',
      h8: 'Day 8',
      p21: '课程题目：基于SprintBoot微服务开发与进阶实战（上）',
      p22: '课程简介：微服务架构介绍、框架搭建、中间件技术介绍；SprintBoot+中间件的微服务项目实例--中间件部署与安装',
      h9: 'Day 9',
      p23: '课程题目：基于SprintBoot微服务开发与进阶实战（下）',
      p24: '课程简介：SprintBoot+中间件的微服务项目实例；ServiceMesh模式介绍、API网关、服务目录、基于Kubernetes的ServiceMesh微服务示例介绍 ',

      til4: '敏捷开发专题',
      h10: 'Day 10',
      p25: '课程题目：敏捷开发-项目管理；敏捷开发-自动化测试',
      p26: '课程简介：项目协作平台迭代管理、需求跟踪、任务分配和缺陷管理使用介绍；接口测试、压力测试和UI测试'

    }
  },
  page_content: {
    line_two: {
      h: '公司介绍',
      p: '铁科经纬（西安）信息技术有限公司成立于2020年，地址位于陕西省西安市碑林区太乙路铁永坊20 号楼3层，所属行业为软件和信息技术服务业，经营范围包含：一般项目：网络技术服务；信息系统集成服务；人工智能公共数据平台； 人工智能基础资源与技术平台；人工智能公共服务平台技术咨询服务； 大数据服务；软件开发；人工 智能基础软件开发；人工智能应用软件开发； 智能税务系统开发；软件外包服务；智能控制系统集成； 技术服务、技术开发、技术咨询、技术交流、技术转让、技术推广。'
    },
    line_three: {
      p1: '西安市碑林区太乙路铁永坊20 号楼3层',
      p2: 'qi.yang@rails.cn',
      p3: '工作时间：8:00-18:00'
    }
  }
}